#простые
int = 1 # целое число
float = 1.0 # вещественное число
complex = 1 + 1j # комлексное число
bool = True #булевое значение
bool = None #пустой тип
#Составные
str = 'hello' #строка
list = [1, 1.0, 'hello'] #список
tuple = (1, 1.0, 'hello') #множество
set = frozenset ({1, 1.0, 'hello'}) #неизменяемое множество
dict = {'a':1,'b':2} #словарь
bytes = b'hello' #байтовый тип
bytearray = (b'hello')
#Вызываемые
list = [1, 1.0, 'hello'] #создаем спиоск
help('a') #выводим информацию об 'a'
print('a') #выводим значение 'a' в консоль
b = input('Введите число') #в консоль выводится сообщение и ожидается когда пользователь введет число
len('a') #сколько объектов в 'a'
min('a') #минимальное значение в 'a'
max('a') #максимальное значение в 'a'
type('a') #тип объекта 'a'
